Финансы/src/Documents/ПеремещениеДенежныхСредств/ПеремещениеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеДенежныхСредств</name>
  <registerRecords>AccumulationRegister.ОстаткиДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <attributes>
    <name>ДатаЗачисления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаСписания</name>
    <type>
      <types>CatalogRef.СчетаУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗачисления</name>
    <type>
      <types>CatalogRef.СчетаУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаСписания</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаЗачисления</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСписания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗачисления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяПеремещения</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПеремещенияДенежныхСредств</name>
    <type>
      <types>CatalogRef.МестаРасходовДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

Финансы/src/Documents/ПеремещениеДенежныхСредств/Forms/ФормаДокумента/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьВалютуСчета(ПараметрСчетУчета)
	
	Возврат ПараметрСчетУчета.ВалютаСчета;
	
КонецФункции

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаЗачисления) Тогда
		Объект.ДатаЗачисления = Объект.Дата;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаСписанияПриИзменении(Элемент)
	
	Объект.ВалютаСписания = ПолучитьВалютуСчета(Объект.СчетУчетаСписания);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаЗачисленияПриИзменении(Элемент)
	
	Объект.ВалютаЗачисления = ПолучитьВалютуСчета(Объект.СчетУчетаЗачисления);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаСписанияПриИзменении(Элемент)
	
	Если Объект.ВалютаЗачисления = Объект.ВалютаСписания Тогда
		Объект.СуммаЗачисления = Объект.СуммаСписания;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаЗачисленияПриИзменении(Элемент)

	Если Объект.ВалютаЗачисления = Объект.ВалютаСписания Тогда
		Объект.СуммаСписания = Объект.СуммаЗачисления;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры
